---
kind: method
id: M:Autodesk.Revit.DB.LinkLoadResult.Dispose
source: html/f9a77193-63c9-849a-1b9a-7252494d7b8c.htm
---
# Autodesk.Revit.DB.LinkLoadResult.Dispose Method

Releases all resources used by the LinkLoadResult

## Syntax (C#)
```csharp
public void Dispose()
```